---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFrameworkElementCreator Members
IFrameworkElementCreator Interface Methods See Also Send Feedback
---

The IFrameworkElementCreator type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | CreateFrameworkElement | Method called to create the FrameworkElement. |

# See Also

IFrameworkElementCreator Interface

Autodesk.Revit.UI Namespace